trade_exp/src/Catalogs/ПотокиТранспортныхСредствПоставкиНаСклад/ПотокиТранспортныхСредствПоставкиНаСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="735c9797-25e5-44eb-8f8a-1633c6be5ce1">
  <name>ПотокиТранспортныхСредствПоставкиНаСклад</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="3c2491b2-2a6c-4b6c-a71a-05c1ee467c74">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3cc493c5-f400-4b1b-a013-3158d1b54643">
    <name>ПотокАктивный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="1edd5cde-e02e-4d4c-8065-0c671bbd8ff7">
    <name>Секции</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="203168ef-32cb-4993-9d9d-f84699c6dd7a">
      <name>Секция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/InformationRegisters/РасписаниеСкладскихПотоков/РасписаниеСкладскихПотоков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="73073e83-36eb-48f7-bb54-afdaa2f25b42">
  <name>РасписаниеСкладскихПотоков</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="5747f0e4-2312-4422-a98f-c4af0f694f68">
    <name>НачалоИнтервала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="0e8eb166-22a0-46b3-9e74-83b058d7ee10">
    <name>ПродолжительностьИнтервала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="67fe8c65-43c4-4c8f-89ca-0a07a1288ed9">
    <name>АвторИзменений</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="d8d80fb8-d205-47c8-a05c-0e5c67256361">
    <name>Поток</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ac74948d-76ab-4a20-8b5b-effe27d381ba">
    <name>ДатаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="bca00498-5f63-418e-9d0d-89b7008ad9f6">
    <name>НомерИнтервала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Catalogs/ПотокиТранспортныхСредствПоставкиНаСклад/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
	ЗаполнитьПланировщик();
	Элементы.РасписаниеПотока.Доступность = Объект.ПотокАктивный;
	 Элементы.ОчиститьРасписание.Видимость = Объект.ПотокАктивный;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПланировщик()

	//Подготовка таблицы
	РасписаниеПотока.ТекущиеПериодыОтображения.Очистить();
	//ПустаяДата = '20200601'; //дата с началом в пн (для отображения интерфейса)
	//ДатаНачала = НачалоНедели(ПустаяДата);
	//ДатаОкончания = КонецНедели(ПустаяДата);
	ДатаНачала = Период.ДатаНачала;
	ДатаОкончания = Период.ДатаОкончания;
	
	РасписаниеПотока.ТекущиеПериодыОтображения.Очистить();
	РасписаниеПотока.ТекущиеПериодыОтображения.Добавить(ДатаНачала, ДатаОкончания);
	//закрасить интервалы фона
	Фон = РасписаниеПотока.ИнтервалыФона.Добавить(ДатаНачала, ДатаОкончания);
	Фон.Цвет = WebЦвета.СеребристоСерый;
	
	Если  ЗначениеЗаполнено(Объект.Ссылка) Тогда
		//Формирование таблицы данных
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасписаниеСкладскихПотоковСрезПоследних.Период КАК Период,
		|	РасписаниеСкладскихПотоковСрезПоследних.Поток КАК Поток,
		|	РасписаниеСкладскихПотоковСрезПоследних.ДатаДоставки КАК ДатаДоставки,
		|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(РасписаниеСкладскихПотоковСрезПоследних.ДатаДоставки, ЧАС, ЧАС(РасписаниеСкладскихПотоковСрезПоследних.НачалоИнтервала)), МИНУТА, МИНУТА(РасписаниеСкладскихПотоковСрезПоследних.НачалоИнтервала)) КАК НачалоИнтервала,
		|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(РасписаниеСкладскихПотоковСрезПоследних.ДатаДоставки, ЧАС, ЧАС(РасписаниеСкладскихПотоковСрезПоследних.НачалоИнтервала)), МИНУТА, МИНУТА(РасписаниеСкладскихПотоковСрезПоследних.НачалоИнтервала) + РасписаниеСкладскихПотоковСрезПоследних.ПродолжительностьИнтервала) КАК КонецИнтервала,
		|	РасписаниеСкладскихПотоковСрезПоследних.ПродолжительностьИнтервала КАК ПродолжительностьИнтервала,
		|	РасписаниеСкладскихПотоковСрезПоследних.АвторИзменений КАК АвторИзменений,
		|	РасписаниеСкладскихПотоковСрезПоследних.НомерИнтервала
		|ИЗ
		|	РегистрСведений.РасписаниеСкладскихПотоков.СрезПоследних(
		|			,
		|			Поток = &Поток
		|				И ДатаДоставки >= &НачалоПериода
		|				И ДатаДоставки <= &КонецПериода
		|				И ПродолжительностьИнтервала > 0) КАК РасписаниеСкладскихПотоковСрезПоследних";
		Запрос.УстановитьПараметр("Поток", Объект.Ссылка);
		Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
		Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
		//Запрос.УстановитьПараметр("ПустаяДата", ПустаяДата);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ДанныеТаблицы = РасписаниеПотока.Элементы;
		РасписаниеПотока.Элементы.Очистить();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//заполнить планировщик
			Интервал = ДанныеТаблицы.Добавить(ВыборкаДетальныеЗаписи.НачалоИнтервала, ВыборкаДетальныеЗаписи.КонецИнтервала);
			Интервал.Текст = "Изменено: " + Строка(Формат(ВыборкаДетальныеЗаписи.Период, "ДФ=dd.MM.yyyy")) + "; Автор: " + ВыборкаДетальныеЗаписи.АвторИзменений;
			Интервал.Значение = Строка(ВыборкаДетальныеЗаписи.ДатаДоставки) + "_"+ Строка(ВыборкаДетальныеЗаписи.НомерИнтервала);
			Интервал.ЦветФона = WebЦвета.СлоноваяКость;
			Интервал.ЦветРамки = WebЦвета.Серебряный;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры // ЗаполнитьПланировщик()

&НаКлиенте
Процедура РасписаниеПотокаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПотокАктивныйПриИзменении(Элемент)
	 Элементы.РасписаниеПотока.Доступность = Объект.ПотокАктивный;
	 Элементы.ОчиститьРасписание.Видимость = Объект.ПотокАктивный;
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеПотокаПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Если Период.ДатаНачала < КонецДня(ТекущаяДата()) Тогда
		//Сообщить("Вы пытаетесь внести изменения в закрытый период. Ваши изменения не могут быть сохранены.");
		//Если Не РольДоступна("ПолныеПрава") Тогда
			//Отказ = Истина;  //тест 
		//КонецЕсли;
	//КонецЕсли;
	
	Если Модифицированность И Объект.ПотокАктивный Тогда
		ТаблицаРасписания =  РасписаниеПотока.Элементы;
		День = Период.ДатаНачала;
		Пока День < Период.ДатаОкончания Цикл
			Если ИзмененныеДни.НайтиПоЗначению(День) <> Неопределено Тогда
				ОтборЗаписей = Новый Структура;
				ОтборЗаписей.Вставить("Поток", Объект.Ссылка);
				ОтборЗаписей.Вставить("ДатаДоставки", День); 
				НаборЗаписей = РегистрыСведений.РасписаниеСкладскихПотоков.СоздатьНаборЗаписей();
				КоличествоИнтервалов = ПолучитьКоличествоИнтерваловВДне(День);
				НаборЗаписей.Отбор.Поток.Установить(Объект.Ссылка);
				НаборЗаписей.Отбор.ДатаДоставки.Установить(День);
				НаборЗаписей.Прочитать();
				НаборЗаписей.Очистить();
				Ит = 0;
				Пока Ит<=КоличествоИнтервалов Цикл
					ЗаписьПланировщика = ТаблицаРасписания.Найти(Строка(День)+"_"+Ит);
					
					Если ЗаписьПланировщика = Неопределено И Ит<>0 Тогда
						Прервать;
					КонецЕсли;
					НоваяЗаписьВРегистр =НаборЗаписей.Добавить();
					НоваяЗаписьВРегистр.Период = ТекущаяДата();
					НоваяЗаписьВРегистр.АвторИзменений = Пользователи.ТекущийПользователь();
					НоваяЗаписьВРегистр.Поток = Объект.Ссылка;
					НоваяЗаписьВРегистр.ДатаДоставки = День;
					Если  ЗаписьПланировщика = Неопределено И Ит=0 Тогда
						НоваяЗаписьВРегистр.НачалоИнтервала = День;
						НоваяЗаписьВРегистр.ПродолжительностьИнтервала = 0;
					Иначе
						НоваяЗаписьВРегистр.НачалоИнтервала = ЗаписьПланировщика.Начало;
						НоваяЗаписьВРегистр.ПродолжительностьИнтервала = (ЗаписьПланировщика.Конец-ЗаписьПланировщика.Начало)/60;
					КонецЕсли;
					НоваяЗаписьВРегистр.НомерИнтервала = Ит;
					Ит = Ит + 1;
				КонецЦикла;
				НаборЗаписей.Записать();
			КонецЕсли;
			День = День + 3600*24;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ЗаполнитьПланировщик();
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеПотокаПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)
	//если повторять, то добавить элементы в планировщик
	РедактируемыйЭлемент = Элемент.ВыделенныеЭлементы[0];
	Расписание = РедактируемыйЭлемент.Расписание;
	ЭлементыРасписанияПотока = РасписаниеПотока.Элементы;
	Если Расписание <> Неопределено Тогда
		ИнтервалыПланировщика = РасписаниеПотока.Элементы;
		ВремяНачала = РедактируемыйЭлемент.Начало;
		ВремяКонца = РедактируемыйЭлемент.Конец;
		ДатаНачала = РедактируемыйЭлемент.Начало;
		ДатаНачалаГода = НачалоГода(ДатаНачала);
		//ДатаКонца = ?(Расписание.ДатаКонца<>'00010101', Расписание.ДатаКонца, НачалоДня(КонецМесяца(ДатаНачала)));
		
		ДатаИнтервала = ДатаНачала;//+3600*24;
		ДатаВремяНачала = ДатаИнтервала+Час(ВремяНачала)*3600+Минута(ВремяНачала)*60; 
		ДатаВремяКонца = ДатаИнтервала+Час(ВремяКонца)*3600+Минута(ВремяКонца)*60;
		
		МассивМесяцы = Новый Массив;
		МассивМесяцы = Расписание.Месяцы;
		ПоследнийМесяц = МассивМесяцы[МассивМесяцы.Количество()-1];
		ТекущийМесяц = Месяц(ДатаНачала); 
		
		Если ПоследнийМесяц = ТекущийМесяц Тогда   
			ДатаКонца = ДобавитьМесяц(ДатаНачала,1); 
		Иначе
			ДатаКонца = ДобавитьМесяц(ДатаНачала, ПоследнийМесяц - ТекущийМесяц); 
		КонецЕсли;  
	
		Если Расписание.ДатаКонца<>'00010101' Тогда
			ДатаКонца = Расписание.ДатаКонца;
		КонецЕсли;
		
		МассивДниНедели = Новый Массив;
		МассивДниНедели =  Расписание.ДниНедели;
		Пока ДатаИнтервала <= ДатаКонца Цикл
			Если МассивМесяцы.Количество() > 0 И МассивМесяцы.Количество() < 12 Тогда
				
				Если МассивМесяцы.Найти(Месяц(ДатаИнтервала)) <> Неопределено Тогда
					Если Расписание.ДниНедели.Количество() > 0 И МассивДниНедели.Количество() < 7 Тогда
						Если МассивДниНедели.Найти(ДеньНедели(ДатаИнтервала)) <> Неопределено Тогда
							НовЭлемент = ЭлементыРасписанияПотока.Добавить(ДатаВремяНачала, ДатаВремяКонца);
							НовЭлемент.Значение = Строка(ДатаИнтервала)+"_"+ПолучитьКоличествоИнтерваловВДне(ДатаИнтервала);	
							НовЭлемент.ЦветФона = WebЦвета.СлоноваяКость;
							НовЭлемент.ЦветРамки = WebЦвета.Серебряный;
						КонецЕсли;
					Иначе
						НовЭлемент = ЭлементыРасписанияПотока.Добавить(ДатаВремяНачала, ДатаВремяКонца);
						НовЭлемент.Значение = Строка(ДатаИнтервала)+"_"+ПолучитьКоличествоИнтерваловВДне(ДатаИнтервала);
						НовЭлемент.ЦветФона = WebЦвета.СлоноваяКость;
						НовЭлемент.ЦветРамки = WebЦвета.Серебряный;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Если МассивДниНедели.Количество() > 0 И МассивДниНедели.Количество() < 7 Тогда
					Если МассивДниНедели.Найти(ДеньНедели(ДатаИнтервала)) <> Неопределено Тогда
						НовЭлемент = ЭлементыРасписанияПотока.Добавить(ДатаВремяНачала, ДатаВремяКонца);
						НовЭлемент.Значение = Строка(ДатаИнтервала)+"_"+ПолучитьКоличествоИнтерваловВДне(ДатаИнтервала);
						НовЭлемент.ЦветФона = WebЦвета.СлоноваяКость;
						НовЭлемент.ЦветРамки = WebЦвета.Серебряный;
					КонецЕсли;
				Иначе
					НовЭлемент = ЭлементыРасписанияПотока.Добавить(ДатаВремяНачала, ДатаВремяКонца);
					НовЭлемент.Значение = Строка(ДатаИнтервала)+"_"+ПолучитьКоличествоИнтерваловВДне(ДатаИнтервала);
					НовЭлемент.ЦветФона = WebЦвета.СлоноваяКость;
					НовЭлемент.ЦветРамки = WebЦвета.Серебряный;
				КонецЕсли;                        
			КонецЕсли;
			ИзмененныеДни.Добавить(ДатаИнтервала);
			ДатаВремяНачала = ДатаВремяНачала + 3600*24;
			ДатаВремяКонца = ДатаВремяКонца + 3600*24;
			ДатаИнтервала = ДатаИнтервала + 3600*24;
		КонецЦикла;
		РедактируемыйЭлемент.Расписание = Неопределено;	
	Иначе
		//простой элемент без расписания
		ДатаИнтервала = НачалоДня(РедактируемыйЭлемент.Начало);
		РедактируемыйЭлемент.Значение = Строка(ДатаИнтервала)+"_"+ПолучитьКоличествоИнтерваловВДне(ДатаИнтервала);
		ИзмененныеДни.Добавить(ДатаИнтервала);
		Если РедактируемыйЭлемент.ЦветФона <> WebЦвета.СлоноваяКость Тогда
			РедактируемыйЭлемент.ЦветФона = WebЦвета.СлоноваяКость;
			РедактируемыйЭлемент.ЦветРамки = WebЦвета.Серебряный;
		КонецЕсли;
	КонецЕсли;
	
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоИнтерваловВДне(ДатаИнтервала)
	КоличествоИнтерваловНаДату = 1;
	Интервалы = РасписаниеПотока.Элементы;
	
	Пока Интервалы.Найти(Строка(ДатаИнтервала)+ "_" + КоличествоИнтерваловНаДату) <> Неопределено Цикл
		КоличествоИнтерваловНаДату = КоличествоИнтерваловНаДату + 1;
	КонецЦикла;
	//Для каждого Интервал из Интервалы Цикл
	//	Если НачалоДня(Интервал.Начало)=ДатаИнтервала Тогда
	//		Интервал.Значение = Строка(ДатаИнтервала)+ "_" +Строка(КоличествоИнтерваловНаДату);
	//		КоличествоИнтерваловНаДату = КоличествоИнтерваловНаДату + 1;
	//	КонецЕсли;
	//КонецЦикла;
	Возврат КоличествоИнтерваловНаДату-1;
КонецФункции // ПолучитьКоличествоИнтерваловВДне(ДатаИнтервала)()

&НаКлиенте
Процедура РасписаниеПотокаПередУдалением(Элемент, Отказ)
	РедактируемыйЭлемент = Элемент.ВыделенныеЭлементы[0];
	Если РедактируемыйЭлемент.Значение <> Неопределено Тогда
		УдалитьЭлементРасписания(НачалоДня(РедактируемыйЭлемент.Начало), Число(Прав(РедактируемыйЭлемент.Значение, 1)));//номер интервала в пределах дня никогда не сможет быть двузначным числом. 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьЭлементРасписания(ДатаДоставки, НомерИнтервала)

	     НаборЗаписи = РегистрыСведений.РасписаниеСкладскихПотоков.СоздатьНаборЗаписей();
		 НаборЗаписи.Отбор.Поток.Установить(Объект.Ссылка);
		 НаборЗаписи.Отбор.ДатаДоставки.Установить(ДатаДоставки);
		 НаборЗаписи.Отбор.НомерИнтервала.Установить(НомерИнтервала);
		 НаборЗаписи.Прочитать();
		 НаборЗаписи.Очистить();
		 НаборЗаписи.Записать();

КонецПроцедуры // УдалитьЭлементРасписания()

&НаКлиенте
Процедура ОчиститьРасписание(Команда)
	ЭлементыРасписания = РасписаниеПотока.Элементы;
	Инд = 0;
	Пока Инд < ЭлементыРасписания.Количество() Цикл 
		Элемент = ЭлементыРасписания[Инд];
		Если Элемент.Начало > Период.ДатаНачала  И Элемент.Начало < Период.ДатаОкончания Тогда
			ЭлементыРасписания.Удалить(Инд);	
			Инд = ?(Инд=0, 0, Инд - 1);
			ИзмененныеДни.Добавить(НачалоДня(Элемент.Начало));
		Иначе 
			Инд = Инд + 1;
		КонецЕсли;
	КонецЦикла;
	Модифицированность = Истина;
КонецПроцедуры
